Autodesk.Revit.DB.Structure.StructuralFramingUtils.FlipEnds(Autodesk.Revit.DB.FamilyInstance)
Flips the ends of the structural framing element.
Remarks:
Only ends of non-concrete structural framing element like beam and brace can be flipped and only in case if it is a line, arc or ellipse element.
familyInstance:
The FamilyInstance, which must be of a structural framing category, non-concrete.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input familyInstance is concrete or is not a line, arc or ellipse element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The input familyInstance is not of a structural framing category.
Since:
2015 Subscription Update

Autodesk.Revit.DB.Structure.StructuralFramingUtils.CanFlipEnds(Autodesk.Revit.DB.FamilyInstance)
Determines if the ends of the given framing element can be flipped.
familyInstance:
The FamilyInstance, which must be of a structural framing category, non-concrete.
Returns:
True for non-concrete line, arc or ellipse framing element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015 Subscription Update

Autodesk.Revit.DB.Structure.StructuralFramingUtils.IsJoinAllowedAtEnd(Autodesk.Revit.DB.FamilyInstance,System.Int32)
Identifies if the indicated end of the framing element is allowed to join to others.
familyInstance:
The FamilyInstance, which must be of a structural framing category.
end:
The index of the end (0 for the start, 1 for the end).
Returns:
True if it is allowed to join. False if it is disallowed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The input familyInstance is not of a structural framing category.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralFramingUtils.AllowJoinAtEnd(Autodesk.Revit.DB.FamilyInstance,System.Int32)
Sets the indicated end of the framing element to be allowed to join to others.
Remarks:
If that end is near other elements it will become joined as a result.
By default all framing elements are allowed to join at ends, so this function is only needed if this element end is already disallowed to join.
familyInstance:
The FamilyInstance, which must be of a structural framing category.
end:
The index of the end (0 for the start, 1 for the end).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The input familyInstance is not of a structural framing category.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralFramingUtils.DisallowJoinAtEnd(Autodesk.Revit.DB.FamilyInstance,System.Int32)
Sets the indicated end of the framing element to not be allowed to join to others.
Remarks:
If this framing element is already joined at this end, it will become disconnected.
familyInstance:
The FamilyInstance, which must be of a structural framing category.
end:
The index of the end (0 for the start, 1 for the end).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The input familyInstance is not of a structural framing category.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralFramingUtils.SetEndReference(Autodesk.Revit.DB.FamilyInstance,System.Int32,Autodesk.Revit.DB.Reference)
Sets the end reference of a framing element.
Remarks:
The setback value will be changed as a result of the removal.
familyInstance:
The FamilyInstance, which must be of a structural framing category, non-concrete and joined.
end:
The index of the end (0 for the start, 1 for the end).
pick:
The reference to set to the given end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The input familyInstance is not of a structural framing category or is concrete or is not joined at given end and cannot have an end reference set.
-or-
The input pick cannot be set as the end reference for the given end of the structural framing element.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralFramingUtils.GetEndReference(Autodesk.Revit.DB.FamilyInstance,System.Int32)
Returns a reference to the end of a framing element according to the setback settings.
familyInstance:
The FamilyInstance, which must be of a structural framing category, non-concrete and joined.
end:
The index of the end (0 for the start, 1 for the end).
Returns:
The end reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The input familyInstance is not of a structural framing category or is concrete or is not joined at given end and cannot have an end reference set.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralFramingUtils.RemoveEndReference(Autodesk.Revit.DB.FamilyInstance,System.Int32)
Resets the end reference of the structural framing element.
Remarks:
The setback value will be changed as a result of the removal.
familyInstance:
The FamilyInstance, which must be of a structural framing category, non-concrete and joined.
end:
The index of the end (0 for the start, 1 for the end).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The input familyInstance is not of a structural framing category or is concrete or is not joined at given end and cannot have an end reference set.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralFramingUtils.IsEndReferenceValid(Autodesk.Revit.DB.FamilyInstance,System.Int32,Autodesk.Revit.DB.Reference)
Determines if the given reference can be set for the given end of the framing element.
familyInstance:
The FamilyInstance, which must be of a structural framing category, non-concrete and joined at the given end.
end:
The index of the end (0 for the start, 1 for the end).
pick:
The reference to be checked against the given end of the framing element.
Returns:
True if the given reference can be set for the given end of the framing element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralFramingUtils.CanSetEndReference(Autodesk.Revit.DB.FamilyInstance,System.Int32)
Determines if a reference can be set for the given end of the framing element.
familyInstance:
The FamilyInstance, which must be of a structural framing category, non-concrete and joined at the given end.
end:
The index of the end (0 for the start, 1 for the end).
Returns:
True if reference can be set for the given end of the framing element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralFramingUtils
A collection of Structural Framing Utilities.
Since:
2015